[M_Orchid_MansBestFriend MissionDefinition]
MissionDescription="Aubrey Callahan III's grandmother is friends with the terrifying Commander Blade. When he died, he left Albaric to find a home with his grandmother. But now that Alberica's grandmother is dead, he inherits an evil creature that he never loved. I am asking you to kill me.."
MissionSummary="Turn off the jingle tracker.."
TeaserText="You can help Aubrey Callahan from the robbery?"

[M_Orchid_MansBestFriend:Bandits MissionObjectiveDefinition]
ProgressMessage="He will kill the thief"

[M_Orchid_MansBestFriend:Rakks MissionObjectiveDefinition]
ProgressMessage="very deadly"

[M_Orchid_MansBestFriend:Skags MissionObjectiveDefinition]
ProgressMessage="Kill Scaggs"
